void Transf( char* );


void Menu1(char a)
 
 {
//***************************************************************************

    int i;
	
    
    for (i=0;i<20;i++) Transf("\r\n");    // очистка терминала
	for (i=0; i<64; i++) Transf ("*");  // вывод приветствия
	Transf("\r\n");
	Transf("\r\n");
	Transf("\r");
	Transf("..........Terminal К614.........\r\n");
	Transf("\r");
	Transf("MENU :\r");
	Transf("-------\r");
	Transf("Расшифровка структуры команды:\r");
	Transf("~ - стартовый байт\r");
	Transf("1 - адрес абонента\r");
	Transf("Установить_F0 -  команда\r");
	Transf("=30000000 - данные команды\r");
	Transf(";- конец пачки \r");
	Transf(".............. \r");
	Transf("Адреса: \r");
	Transf("1 - 1У-К614   , синхронизатор : \r");
	Transf("3 - 1У-К612   , синтезатор частоты излучения  \r");
	Transf("4 - 1У-К613   , синтезатор частоты гетеродина \r");
	Transf("6 - 1У-К611   , формирователь опорных частот  \r");
	Transf("---------------------------------------------\r\n");
	Transf("IP  :192.168.10.15 - IP адрес    блока\r");
	Transf("PORT:3001          - номер порта блока\r");
	Transf("~1 menu; - текущее меню\r");
	Transf("-------------------------------------------\r");
	Transf("\r");
	Transf("~1 Установить_FS=430000000; частота синтезатора излучения , в Гц\r");
	Transf("~1 Установить_FG=390000000; частота синтезатора гетеродина, в Гц\r");
//	Transf("~1 Установить_Амплитуду_FS:15;	в ДБм\r");
//	Transf("~1 Установить_Амплитуду_FG:15;	в ДБм\r")
	Transf("~1 Установить_девиацию_ЛЧМ:2000000; в Гц (для ЛЧМ)\r");
	Transf("~1 Длительность_импульса_Tимп:10;  в мкс \r");
	Transf("~1 Длительность_интервала:1;  в мс \r");
	Transf("~1 Число_импульсов_в_пачке:1;  в Гц \r");
	Transf("~1 Установить_ЛЧМ_+; - включает ЛЧМ сигнал\r");
	Transf("~1 Установить_ЛЧМ_-; - включает ЛЧМ сигнал\r");
	Transf("-------------------------------------------\r");
	Transf("\r\n");
	//*******************************************************************************
}
